Core/src/src/Documents/ПеремещениеВА/ПеремещениеВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПеремещениеВА</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.ПараметрыВнеоборотныхАктивов</registerRecords>
  <registerRecords>InformationRegister.СостоянияВнеоборотныхАктивов</registerRecords>
  <registerRecords>InformationRegister.УчетПоПроектамВнеоборотныхАктивов</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDTТН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусТН</name>
    <type>
      <types>EnumRef.РС_СтатусыТН</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВнеоборотныеАктивы</name>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <type>
        <types>CatalogRef.ВнеоборотныеАктивы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиницаПолучатель</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПолучатель</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизациюВТекущемМесяце</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокИспользованияДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДляВычисленияАмортизации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодовойПроцентАмортизацииДляУменьшенногоОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛиквидационнаяСтоимостьДляУменьшенногоОстатка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроектПолучатель</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственноеЛицо</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РыночнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Амортизация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидОперации</name>
      <type>
        <types>EnumRef.ВидыОперацийПеремещенияВА</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Enums/СостоянияВнеоборотныхАктивов/СостоянияВнеоборотныхАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияВнеоборотныхАктивов</name>
  <enumValues>
    <name>ПринятКУчету</name>
  </enumValues>
  <enumValues>
    <name>СнятСУчета</name>
  </enumValues>
  <enumValues>
    <name>НеПринятКУчету</name>
  </enumValues>
</mdclass:Enum>

Core/src/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналом</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетниками</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходу</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналомРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетникамиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПоУмолчанию</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателейДоходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаИностранскомЯзыке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисленияУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyUserAccountId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PersonId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AzRyJiraUserIDs</name>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>70</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/Documents/ПеремещениеВА/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПеремещениеВА);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета());
	
	//ПодольскийАИ #УчетПроектов 10.12.2020 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 10.12.2020 }
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПеремещениеВА.Ссылка,
	|	ПеремещениеВА.Номер,
	|	ПеремещениеВА.Дата,
	|	ПеремещениеВА.Организация
	|ПОМЕСТИТЬ ВременнаяТаблицаШапка
	|ИЗ
	|	Документ.ПеремещениеВА КАК ПеремещениеВА
	|ГДЕ
	|	ПеремещениеВА.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка,
	|	ПеремещениеВАВнеоборотныеАктивы.НомерСтроки,
	|	ПеремещениеВАВнеоборотныеАктивы.ВнеоборотныйАктив,
	|	ПеремещениеВАВнеоборотныеАктивы.СтруктурнаяЕдиница,
	|	ПеремещениеВАВнеоборотныеАктивы.СтруктурнаяЕдиницаПолучатель,
	|	ПеремещениеВАВнеоборотныеАктивы.Адрес,
	|	ПеремещениеВАВнеоборотныеАктивы.АдресПолучатель,
	|	ПеремещениеВАВнеоборотныеАктивы.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.ПервоначальнаяСтоимость,
	|	ПеремещениеВАВнеоборотныеАктивы.НачислятьАмортизациюВТекущемМесяце,
	|	ПеремещениеВАВнеоборотныеАктивы.СрокИспользованияДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.СчетЗатрат,
	|	ПеремещениеВАВнеоборотныеАктивы.НаправлениеДеятельности,
	|	ПеремещениеВАВнеоборотныеАктивы.СчетЗатратРегл,
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка.Дата КАК Период,
	|	&ВалютаУчета КАК Валюта,
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка.Организация КАК Организация,
	|	ПеремещениеВАВнеоборотныеАктивы.ГодовойПроцентАмортизацииДляУменьшенногоОстатка КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ПеремещениеВАВнеоборотныеАктивы.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка,
	//ПодольскийАИ #УчетПроектов 08.12.2020 {
	|	Выбор 
	|		Когда &УчетПоПроектам 
	|			Тогда ПеремещениеВАВнеоборотныеАктивы.Проект
	|		Иначе Значение(Справочник.Проекты.ПустаяСсылка)
	|	Конец КАК Проект,
	|	Выбор 
	|		Когда &УчетПоПроектам 
	|			Тогда ПеремещениеВАВнеоборотныеАктивы.ПроектПолучатель
	|		Иначе Значение(Справочник.Проекты.ПустаяСсылка)
	|	Конец КАК ПроектПолучатель 
	//+++ Дмгг
	|,
	|	ВЫБОР
	|		КОГДА ФункциональнаяОпцияЗаполненияОтветственногоЛицаВДокументеПеремещениеВА.Значение
	|			ТОГДА ПеремещениеВАВнеоборотныеАктивы.ОтветственноеЛицо
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|	КОНЕЦ КАК ОтветственноеЛицо,
	|	ВЫБОР
	|		КОГДА ФункциональнаяОпцияЗаполненияОтветственногоЛицаВДокументеПеремещениеВА.Значение
	|			ТОГДА ПеремещениеВАВнеоборотныеАктивы.РыночнаяЦена
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена
	|,
	|	ПеремещениеВАВнеоборотныеАктивы.Амортизация,
	|	ПеремещениеВАВнеоборотныеАктивы.ВидОперации
	//ПодольскийАИ #УчетПроектов 08.12.2020 }
	|ПОМЕСТИТЬ ВременнаяТаблицаВнеоборотныхАктивов
	|ИЗ
	|	Документ.ПеремещениеВА.ВнеоборотныеАктивы КАК ПеремещениеВАВнеоборотныеАктивы
	|,	Константа.ФункциональнаяОпцияЗаполненияОтветственногоЛицаВДокументеПеремещениеВА КАК ФункциональнаяОпцияЗаполненияОтветственногоЛицаВДокументеПеремещениеВА //+++ Дмгг
	|ГДЕ
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка = &Ссылка";
	
	Запрос.ВыполнитьПакет();
	
	// Формирование таблиц движений по разделам учета.
	СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства);
	
	//ПодольскийАИ #УчетПроектов 08.12.2020 {
	СформироватьТаблицаУчетПоПроектамВнеоборотныхАктивов(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства);
	//ПодольскийАИ #УчетПроектов 08.12.2020 }
	
	СформироватьТаблицаСостоянияВнеоборотныхАктивов(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства);
	
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ПеремещениеВА(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства);
	
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиница,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,	
	|	ТаблицаДокумента.НачислятьАмортизациюВТекущемМесяце КАК ПрименитьВТекущемМесяце,
	|	ТаблицаДокумента.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаДокумента.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ТаблицаДокумента.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.АдресПолучатель КАК Адрес,
	|	ТаблицаДокумента.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ТаблицаДокумента.ГодовойПроцентАмортизацииДляУменьшенногоОстатка КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ТаблицаДокумента.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка,
	//+++ Дмгг
	|	ТаблицаДокумента.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ТаблицаДокумента.Цена КАК Цена,
	|	ТаблицаДокумента.ВидОперации
	//--- Дмгг
	|ИЗ
	|	ВременнаяТаблицаВнеоборотныхАктивов КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаПараметрыВнеоборотныхАктивов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПараметрыВнеоборотныхАктивов()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСостоянияВнеоборотныхАктивов(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Амортизация КАК НачислятьАмортизацию,
	|	ТаблицаДокумента.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяце,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияВнеоборотныхАктивов.ПринятКУчету) КАК Состояние
	//--- Дмгг
	|ИЗ
	|	ВременнаяТаблицаВнеоборотныхАктивов КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостоянияВнеоборотныхАктивов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПараметрыВнеоборотныхАктивов()

//ПодольскийАИ #УчетПроектов 08.12.2020 {
// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУчетПоПроектамВнеоборотныхАктивов(ДокументСсылкаПеремещениеВА, СтруктураДополнительныеСвойства)
	
	Если Не СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Период КАК Период,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.Проект КАК ПроектТекущий,
	|	ТаблицаДокумента.ПроектПолучатель КАК Проект
	|ИЗ
	|	ВременнаяТаблицаВнеоборотныхАктивов КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Проект <> ТаблицаДокумента.ПроектПолучатель
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУчетПоПроектамВнеоборотныхАктивов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаПараметрыВнеоборотныхАктивов()

//ПодольскийАИ #УчетПроектов 08.12.2020 }

#Область ИнтерфейсПечати

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Перем Ошибки;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктПриемаПередачи") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,              
															"ПФ_MXL_АктПриемаПередачи", 
															НСтр("ru = 'Акт приема-передачи'; en = 'Акт приема-передачи'; ka = 'მიღება ჩაბარების აქტი'"), 
															ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктПриемаПередачи"));
															
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктПриемаПередачиВозврат") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,              
															"ПФ_MXL_АктПриемаПередачиВозврат", 
															НСтр("ru = 'Акт приема-передачи Возврат'; en = 'Акт приема-передачи Возврат'; ka = 'მიღება ჩაბარების აქტი დაბრუნება'"), 
															ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "ПФ_MXL_АктПриемаПередачиВозврат"));
		
	КонецЕсли;
	

	Если Ошибки <> Неопределено Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
		
	КонецЕсли;
	
	// параметры отправки печатных форм по электронной почте
	УправлениеНебольшойФирмойСервер.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	Перем Ошибки;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "ПФ_MXL_АктПриемаПередачи" Тогда
			
			СформироватьАктПриемаПередачи(ТабличныйДокумент, ТекущийДокумент);
			
		ИначеЕсли ИмяМакета = "ПФ_MXL_АктПриемаПередачиВозврат" Тогда
			
			СформироватьАктПриемаПередачиВозврат(ТабличныйДокумент, ТекущийДокумент);
			
		КонецЕсли;

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки);
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	ЗначениеИдентификатора = "ПФ_MXL_АктПриемаПередачи";
	//ЗначениеИдентификатора = СтрШаблон(ЗначениеИдентификатора, Обработки.ПечатьАктПередачиПрав.ИдентификаторПечатнойФормы());
	
	Если УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункциональнаяОпцияЗаполненияОтветственногоЛицаВДокументеПеремещениеВА") Тогда 
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "ПФ_MXL_АктПриемаПередачи";
		КомандаПечати.Представление = НСтр("ru = 'Акт приема-передачи'; en = 'Акт приема-передачи'; ka = 'მიღება ჩაბარების აქტი'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 32;
		
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "ПФ_MXL_АктПриемаПередачиВозврат";
		КомандаПечати.Представление = НСтр("ru = 'Акт приема-передачи Возврат'; en = 'Акт приема-передачи Возврат'; ka = 'მიღება ჩაბარების აქტი დაბრუნება'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
		КомандаПечати.Порядок = 33;
		
	КонецЕсли;

КонецПроцедуры

Процедура СформироватьАктПриемаПередачи(ТабличныйДокумент, ТекущийДокумент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка КАК Ссылка,
	|	ПеремещениеВАВнеоборотныеАктивы.НомерСтроки КАК НомерСтроки,
	|	ПеремещениеВАВнеоборотныеАктивы.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ПеремещениеВАВнеоборотныеАктивы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПеремещениеВАВнеоборотныеАктивы.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
	|	ПеремещениеВАВнеоборотныеАктивы.Адрес КАК Адрес,
	|	ПеремещениеВАВнеоборотныеАктивы.АдресПолучатель КАК АдресПолучатель,
	|	ПеремещениеВАВнеоборотныеАктивы.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	ПеремещениеВАВнеоборотныеАктивы.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяце,
	|	ПеремещениеВАВнеоборотныеАктивы.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.СчетЗатрат КАК СчетЗатрат,
	|	ПеремещениеВАВнеоборотныеАктивы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПеремещениеВАВнеоборотныеАктивы.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ПеремещениеВАВнеоборотныеАктивы.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.ГодовойПроцентАмортизацииДляУменьшенногоОстатка КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ПеремещениеВАВнеоборотныеАктивы.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка,
	|	ПеремещениеВАВнеоборотныеАктивы.Проект КАК Проект,
	|	ПеремещениеВАВнеоборотныеАктивы.ПроектПолучатель КАК ПроектПолучатель,
	|	ПеремещениеВАВнеоборотныеАктивы.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ПеремещениеВАВнеоборотныеАктивы.РыночнаяЦена КАК РыночнаяЦена,
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка.Дата КАК Дата,
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка.Организация.ИНН КАК ИНН,
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка.Организация.Представление КАК Организация
	|ИЗ
	|	Документ.ПеремещениеВА.ВнеоборотныеАктивы КАК ПеремещениеВАВнеоборотныеАктивы
	|ГДЕ
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтветственноеЛицо
	|ИТОГИ ПО
	|	ОтветственноеЛицо";
	
	ВыборкаРезультат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеВА.ПФ_MXL_АктПриемаПередачи");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Пока ВыборкаРезультат.Следующий() Цикл 
		
		СтруктураПринятияНаРаботу = ПлучитьДокументПринятнияНаРаботу(ВыборкаРезультат.ОтветственноеЛицо);
		
		
		ОбластьЗаголовок.Параметры.ДатаРус = Формат(ТекущийДокумент.Дата,"ДФ=dd.MM.yyyy") + " г.";
		ОбластьЗаголовок.Параметры.ДатаГру = Формат(ТекущийДокумент.Дата,"ДФ=dd.MM.yyyy") + " წ.";
		ОбластьЗаголовок.Параметры.Организация = ТекущийДокумент.Организация;
		ОбластьЗаголовок.Параметры.ИНН = ТекущийДокумент.Организация.ИНН;
		ОбластьЗаголовок.Параметры.Сотрудник = ВыборкаРезультат.ОтветственноеЛицо;
		ОбластьЗаголовок.Параметры.СотрудникРус = ВыборкаРезультат.ОтветственноеЛицо.НаименованиеНаИностранскомЯзыке;
		ОбластьЗаголовок.Параметры.ДокументСотрудника = ВыборкаРезультат.ОтветственноеЛицо.Физлицо.ИНН;//СтруктураПринятияНаРаботу.НомерПаспорта;
		НомерПриема = ?(СтруктураПринятияНаРаботу.НомерПриема= Неопределено, "", СтруктураПринятияНаРаботу.НомерПриема);
		ДатаПриема = ?(СтруктураПринятияНаРаботу.ДатаПриема= Неопределено, "", СтруктураПринятияНаРаботу.ДатаПриема);
		НомерПриемаПечать = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(НомерПриема, Истина, Истина);
		ОбластьЗаголовок.Параметры.НомерДатаДоговора = НомерПриемаПечать + " от " + СтрЗаменить(Формат(ДатаПриема,"Л=ru_RU; ДЛФ=DD"), "г.", "года");
		МесяцДатыТекстомПлатформа = Формат(ДатаПриема,"Л=ka_GE; ДФ=MMMM");
		МесяцДатыТекстомДляПФ = ПоменятьПоследнююБукву(МесяцДатыТекстомПлатформа);
		ОбластьЗаголовок.Параметры.НомерДатаДоговораГру = СтрЗаменить(СтрЗаменить(Формат(ДатаПриема,"Л=ka_GE; ДФ=yyyy"), ".", " ") + " წლის " + СтрЗаменить(Формат(ДатаПриема,"Л=ka_GE; ДФ=d.MMMM"), ".", " "), МесяцДатыТекстомПлатформа, МесяцДатыТекстомДляПФ) + " გაფორმებული №" + НомерПриемаПечать;
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		//Для Каждого Строк Из ВыборкаСтрокВА Цикл 
		НПП = 1;
		ИтогоЦена = 0;
		РезультатТаблица = ВыборкаРезультат.Выбрать();
		Пока РезультатТаблица.Следующий() Цикл
			
			ОбластьСтрокаТаблицы.Параметры.НПП = НПП;
			ОбластьСтрокаТаблицы.Параметры.ОсновноеСредство = РезультатТаблица.ВнеоборотныйАктив;
			ОбластьСтрокаТаблицы.Параметры.Количество = 1;
			ОбластьСтрокаТаблицы.Параметры.Цена = Формат(РезультатТаблица.РыночнаяЦена, "ЧДЦ=2");
			
			НПП = НПП + 1;
			ИтогоЦена = ИтогоЦена + РезультатТаблица.РыночнаяЦена;
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		
		ОбластьПодвал.Параметры.ИтогоЦена = Формат(ИтогоЦена, "ЧДЦ=2");
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьНакладную()

Процедура СформироватьАктПриемаПередачиВозврат(ТабличныйДокумент, ТекущийДокумент)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка КАК Ссылка,
	|	ПеремещениеВАВнеоборотныеАктивы.НомерСтроки КАК НомерСтроки,
	|	ПеремещениеВАВнеоборотныеАктивы.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ПеремещениеВАВнеоборотныеАктивы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ПеремещениеВАВнеоборотныеАктивы.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
	|	ПеремещениеВАВнеоборотныеАктивы.Адрес КАК Адрес,
	|	ПеремещениеВАВнеоборотныеАктивы.АдресПолучатель КАК АдресПолучатель,
	|	ПеремещениеВАВнеоборотныеАктивы.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	ПеремещениеВАВнеоборотныеАктивы.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяце,
	|	ПеремещениеВАВнеоборотныеАктивы.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.СчетЗатрат КАК СчетЗатрат,
	|	ПеремещениеВАВнеоборотныеАктивы.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ПеремещениеВАВнеоборотныеАктивы.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ПеремещениеВАВнеоборотныеАктивы.СтоимостьДляВычисленияАмортизации КАК СтоимостьДляВычисленияАмортизации,
	|	ПеремещениеВАВнеоборотныеАктивы.ГодовойПроцентАмортизацииДляУменьшенногоОстатка КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ПеремещениеВАВнеоборотныеАктивы.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка,
	|	ПеремещениеВАВнеоборотныеАктивы.Проект КАК Проект,
	|	ПеремещениеВАВнеоборотныеАктивы.ПроектПолучатель КАК ПроектПолучатель,
	|	ПеремещениеВАВнеоборотныеАктивы.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ПеремещениеВАВнеоборотныеАктивы.РыночнаяЦена КАК РыночнаяЦена,
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка.Дата КАК Дата,
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка.Организация.ИНН КАК ИНН,
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка.Организация.Представление КАК Организация
	|ИЗ
	|	Документ.ПеремещениеВА.ВнеоборотныеАктивы КАК ПеремещениеВАВнеоборотныеАктивы
	|ГДЕ
	|	ПеремещениеВАВнеоборотныеАктивы.Ссылка = &ТекущийДокумент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтветственноеЛицо
	|ИТОГИ ПО
	|	ОтветственноеЛицо";
	
	ВыборкаРезультат = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ПеремещениеВА.ПФ_MXL_АктПриемаПередачиВозврат");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьПустаяСтрока = Макет.ПолучитьОбласть("ПустаяСтрока");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Пока ВыборкаРезультат.Следующий() Цикл 
		
		СтруктураПринятияНаРаботу = ПлучитьДокументПринятнияНаРаботу(ВыборкаРезультат.ОтветственноеЛицо);
		
		
		ОбластьЗаголовок.Параметры.ДатаРус = Формат(ТекущийДокумент.Дата,"ДФ=dd.MM.yyyy") + " г.";
		ОбластьЗаголовок.Параметры.ДатаГру = Формат(ТекущийДокумент.Дата,"ДФ=dd.MM.yyyy") + " წ.";
		ОбластьЗаголовок.Параметры.Организация = ТекущийДокумент.Организация;
		ОбластьЗаголовок.Параметры.ИНН = ТекущийДокумент.Организация.ИНН;
		ОбластьЗаголовок.Параметры.Сотрудник = ВыборкаРезультат.ОтветственноеЛицо;
		ОбластьЗаголовок.Параметры.СотрудникРус = ВыборкаРезультат.ОтветственноеЛицо.НаименованиеНаИностранскомЯзыке;
		ОбластьЗаголовок.Параметры.ДокументСотрудника = ВыборкаРезультат.ОтветственноеЛицо.Физлицо.ИНН;//СтруктураПринятияНаРаботу.НомерПаспорта;
		НомерПриема = ?(СтруктураПринятияНаРаботу.НомерПриема= Неопределено, "", СтруктураПринятияНаРаботу.НомерПриема);
		ДатаПриема = ?(СтруктураПринятияНаРаботу.ДатаПриема= Неопределено, "", СтруктураПринятияНаРаботу.ДатаПриема);
		НомерПриемаПечать = ПрефиксацияОбъектовКлиентСервер.ПолучитьНомерНаПечать(НомерПриема, Истина, Истина);
		ОбластьЗаголовок.Параметры.НомерДатаДоговора = НомерПриемаПечать + " от " + СтрЗаменить(Формат(ДатаПриема,"Л=ru_RU; ДЛФ=DD"), "г.", "года");
		МесяцДатыТекстомПлатформа = Формат(ДатаПриема,"Л=ka_GE; ДФ=MMMM");
		МесяцДатыТекстомДляПФ = ПоменятьПоследнююБукву(МесяцДатыТекстомПлатформа);
		ОбластьЗаголовок.Параметры.НомерДатаДоговораГру = СтрЗаменить(СтрЗаменить(Формат(ДатаПриема,"Л=ka_GE; ДФ=yyyy"), ".", " ") + " წლის " + СтрЗаменить(Формат(ДатаПриема,"Л=ka_GE; ДФ=d.MMMM"), ".", " "), МесяцДатыТекстомПлатформа, МесяцДатыТекстомДляПФ) + " გაფორმებული №" + НомерПриемаПечать;
		
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		//Для Каждого Строк Из ВыборкаСтрокВА Цикл 
		НПП = 1;
		ИтогоЦена = 0;
		РезультатТаблица = ВыборкаРезультат.Выбрать();
		Пока РезультатТаблица.Следующий() Цикл
			
			ОбластьСтрокаТаблицы.Параметры.НПП = НПП;
			ОбластьСтрокаТаблицы.Параметры.ОсновноеСредство = РезультатТаблица.ВнеоборотныйАктив;
			//ОбластьСтрокаТаблицы.Параметры.Количество = 1;
			//ОбластьСтрокаТаблицы.Параметры.Цена = Формат(РезультатТаблица.РыночнаяЦена, "ЧДЦ=2");
			
			НПП = НПП + 1;
			ИтогоЦена = ИтогоЦена + РезультатТаблица.РыночнаяЦена;
			ТабличныйДокумент.Вывести(ОбластьСтрокаТаблицы);
			
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьПустаяСтрока);
		
		//ОбластьПодвал.Параметры.ИтогоЦена = Формат(ИтогоЦена, "ЧДЦ=2");
		
		ОбластьПодвал.Параметры.НомерДатаДоговора = НомерПриемаПечать + " от " + СтрЗаменить(Формат(ДатаПриема,"Л=ru_RU; ДЛФ=DD"), "г.", "года");
		ОбластьПодвал.Параметры.НомерДатаДоговораГру = СтрЗаменить(СтрЗаменить(Формат(ДатаПриема,"Л=ka_GE; ДФ=yyyy"), ".", " ") + " წლის " + СтрЗаменить(Формат(ДатаПриема,"Л=ka_GE; ДФ=d.MMMM"), ".", " "), МесяцДатыТекстомПлатформа, МесяцДатыТекстомДляПФ) + " გაფორმებული №" + НомерПриемаПечать;
		ОбластьПодвал.Параметры.ЦенаЛари = Цел(ИтогоЦена);
		ОбластьПодвал.Параметры.ЦенаТетри = (ИтогоЦена - Цел(ИтогоЦена)) * 100;
		
		ТабличныйДокумент.Вывести(ОбластьПодвал);
		
	КонецЦикла;
	
КонецПроцедуры // СформироватьНакладную()

Функция ПлучитьДокументПринятнияНаРаботу(Сотрудник)

	СтуркутраПриемаНаРаботу = Новый Структура("ДатаПриема, НомерПриема, НомерПаспорта");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СотрудникиСрезПервых.Период КАК Период,
		|	СотрудникиСрезПервых.Регистратор.Номер КАК РегистраторНомер,
		|	ЕСТЬNULL(ДокументыФизическихЛицСрезПоследних.Серия, """") КАК Серия,
		|	ЕСТЬNULL(ДокументыФизическихЛицСрезПоследних.Номер, """") КАК Номер
		|ИЗ
		|	РегистрСведений.Сотрудники.СрезПервых(, Сотрудник = &Сотрудник) КАК СотрудникиСрезПервых
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(, ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортГР)) КАК ДокументыФизическихЛицСрезПоследних
		|		ПО СотрудникиСрезПервых.Сотрудник.Физлицо = ДокументыФизическихЛицСрезПоследних.Физлицо";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтуркутраПриемаНаРаботу.ДатаПриема = ВыборкаДетальныеЗаписи.Период;
		СтуркутраПриемаНаРаботу.НомерПриема = ВыборкаДетальныеЗаписи.РегистраторНомер;
		СтуркутраПриемаНаРаботу.НомерПаспорта = ВыборкаДетальныеЗаписи.Серия + ВыборкаДетальныеЗаписи.Номер;
	КонецЦикла;
	
	Возврат СтуркутраПриемаНаРаботу;

КонецФункции // ПлучитьДокументПринятнияНаРаботу(ВыборкаРезультат.ОтветственноеЛицо)()

Функция ПоменятьПоследнююБукву(МесяцДатыТекстомПлатформа)
	
	ДлиннаТекста = СтрДлина(МесяцДатыТекстомПлатформа);
	
	НовыйВариант = Лев(МесяцДатыТекстомПлатформа, ДлиннаТекста-1) + "ს";
	
	Возврат НовыйВариант;
	
КонецФункции

#Область ШаблоныСообщений

// Вызывается при подготовке шаблонов сообщений и позволяет переопределить список реквизитов и вложений.
//
// Параметры:
//  Реквизиты               - ДеревоЗначений - список реквизитов шаблона.
//         ** Имя            - Строка - Уникальное имя общего реквизита.
//         ** Представление  - Строка - Представление общего реквизита.
//         ** Тип            - Тип    - Тип реквизита. По умолчанию строка.
//         ** Формат         - Строка - Формат вывода значения для чисел, дат, строк и булевых значений.
//  Вложения                - ТаблицаЗначений - печатные формы и вложения
//         ** Имя            - Строка - Уникальное имя вложения.
//         ** Представление  - Строка - Представление варианта.
//         ** ТипФайла       - Строка - Тип вложения, который соответствует расширению файла: "pdf", "png", "jpg", mxl" и др.
//  ДополнительныеПараметры - Структура - дополнительные сведения о шаблоне сообщений.
//
Процедура ПриПодготовкеШаблонаСообщения(Реквизиты, Вложения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// Вызывается в момент создания сообщений по шаблону для заполнения значений реквизитов и вложений.
//
// Параметры:
//  Сообщение - Структура - структура с ключами:
//    * ЗначенияРеквизитов - Соответствие - список используемых в шаблоне реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * ЗначенияОбщихРеквизитов - Соответствие - список используемых в шаблоне общих реквизитов.
//      ** Ключ     - Строка - имя реквизита в шаблоне;
//      ** Значение - Строка - значение заполнения в шаблоне.
//    * Вложения - Соответствие - значения реквизитов 
//      ** Ключ     - Строка - имя вложения в шаблоне;
//      ** Значение - ДвоичныеДанные, Строка - двоичные данные или адрес во временном хранилище вложения.
//  ПредметСообщения - ЛюбаяСсылка - ссылка на объект являющийся источником данных.
//  ДополнительныеПараметры - Структура -  Дополнительная информация о шаблоне сообщения.
//
Процедура ПриФормированииСообщения(Сообщение, ПредметСообщения, ДополнительныеПараметры) Экспорт
	
КонецПроцедуры

// Заполняет список получателей SMS при отправке сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиSMS - ТаблицаЗначений - список получается SMS.
//     * НомерТелефона - Строка - номер телефона, куда будет отправлено сообщение SMS.
//     * Представление - Строка - представление получателя сообщения SMS.
//     * Контакт       - Произвольный - контакт, которому принадлежит номер телефона.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.//
//
Процедура ПриЗаполненииТелефоновПолучателейВСообщении(ПолучателиSMS, ПредметСообщения) Экспорт
	
КонецПроцедуры

// Заполняет список получателей письма при отправки сообщения сформированного по шаблону.
//
// Параметры:
//   ПолучателиПисьма - ТаблицаЗначений - список получается письма.
//     * Адрес           - Строка - адрес электронной почты получателя.
//     * Представление   - Строка - представление получается письма.
//     * Контакт         - Произвольный - контакт, которому принадлежит адрес электрнной почты.
//  ПредметСообщения - ЛюбаяСсылка, Структура - ссылка на объект являющийся источником данных, либо структура,
//                                              если шаблон содержит произвольные параметры:
//    * Предмет               - ЛюбаяСсылка - ссылка на объект являющийся источником данных
//    * ПроизвольныеПараметры - Соответствие - заполненный список произвольных параметров.
//
Процедура ПриЗаполненииПочтыПолучателейВСообщении(ПолучателиПисьма, ПредметСообщения) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
